_posts/2016-04-28-Managing-contexts---Python-vs-hy.html
---
title: Managing contexts - Python vs hy
date: 2016/04/28 14:32:40
updated: 2016/04/28 14:32:40
categories: hylang,python
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. a try/except/finally approach</a></li>
<li><a href="#sec-2">2. A Python context manager</a></li>
<li><a href="#sec-3">3. A python decorator</a></li>
<li><a href="#sec-4">4. A hy macro approach</a></li>
</ul>
</div>
</div>

<p>
A common pattern we have in running molecular simulations is to temporarily change to a new directory, do some stuff, and then change back to the directory, even if something goes wrong and an exception is raised. Here we examine several approaches to handling this in Python.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> a try/except/finally approach</h2>
<div class="outline-text-2" id="text-1">
<p>
A way to handle this is with a try/except/finally block in Python. Here we illustrate the idea. Nothing fancy happens for the exception here, other than we do get back to the original directory before the program ends. There is nothing wrong with this, but it is not that reusable, and has a lot of places to make sure the right thing happens.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">import</span> os
<span style="color: #0000FF;">print</span>(os.getcwd())
<span style="color: #0000FF;">try</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">cwd</span> = os.getcwd()
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   os.chdir(<span style="color: #008000;">'/tmp'</span>)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">f</span> = <span style="color: #006FE0;">open</span>(<span style="color: #008000;">'some-file'</span>, <span style="color: #008000;">'w'</span>)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   f.write(<span style="color: #008000;">'5'</span>)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(os.getcwd())
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   1 / 0
<span style="color: #0000FF;">except</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">pass</span>
<span style="color: #0000FF;">finally</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   f.close()
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   os.chdir(cwd)

<span style="color: #0000FF;">print</span>(os.getcwd())

<span style="color: #0000FF;">print</span>(<span style="color: #006FE0;">open</span>(<span style="color: #008000;">'/tmp/some-file'</span>).read())
</pre>
</div>

<pre class="example">
/Users/jkitchin/Dropbox/python/hyve
/private/tmp
/Users/jkitchin/Dropbox/python/hyve
5
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> A Python context manager</h2>
<div class="outline-text-2" id="text-2">
<p>
A more sophisticated way to handle this in Python is a context manager. We create a context manager here called cd that does the same thing. The context manager is longer, but we would presumably put this in module and import it. This allows us to to the same thing in a lot less code afterwards, and to reuse this pattern. We also use the built in context manager for opening a file. This is for the most part a syntactical sugar for the code above.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">import</span> contextlib

<span style="color: #6434A3;">@contextlib.contextmanager</span>
<span style="color: #0000FF;">def</span> <span style="color: #006699;">cd</span>(wd):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">import</span> os
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">cwd</span> = os.getcwd()
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'Started in {}'</span>.<span style="color: #006FE0;">format</span>(os.getcwd()))
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   os.chdir(wd)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'Entered {}'</span>.<span style="color: #006FE0;">format</span>(os.getcwd()))
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">try</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">yield</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">except</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">pass</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">finally</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   os.chdir(cwd)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'Entered {}'</span>.<span style="color: #006FE0;">format</span>(os.getcwd()))

<span style="color: #8D8D84;">##################################################################</span>
<span style="color: #0000FF;">with</span> cd(<span style="color: #008000;">'/tmp'</span>):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">with</span> <span style="color: #006FE0;">open</span>(<span style="color: #008000;">'some-other-file'</span>, <span style="color: #008000;">'w'</span>) <span style="color: #0000FF;">as</span> f:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   f.write(<span style="color: #008000;">'5'</span>)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   1 / 0

<span style="color: #0000FF;">print</span>(<span style="color: #006FE0;">open</span>(<span style="color: #008000;">'/tmp/some-other-file'</span>).read())
</pre>
</div>

<pre class="example">
Started in /Users/jkitchin/Dropbox/python/hyve
Entered /private/tmp
Entered /Users/jkitchin/Dropbox/python/hyve
5
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> A python decorator</h2>
<div class="outline-text-2" id="text-3">
<p>
Here is an example of doing something like this with a decorator. I don't do this too often, but this does more or less the same thing. It does eliminate a with statement and provide some context to do work in. The overall indentation is identical to the context manager we looked at previously because we have to wrap our code in a function to delay its execution, which we have to ask for with f(). A downside of this is f is always decorated now. I am not sure you can undecorate it.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">import</span> os

<span style="color: #0000FF;">def</span> <span style="color: #006699;">cd</span>(wd):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">def</span> <span style="color: #006699;">outer</span>(func):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">def</span> <span style="color: #006699;">inner</span>(*args):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">cwd</span> = os.getcwd()
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'Started in {}'</span>.<span style="color: #006FE0;">format</span>(os.getcwd()))
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   os.chdir(wd)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'entered {}'</span>.<span style="color: #006FE0;">format</span>(os.getcwd()))
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">try</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> func(*args)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">except</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">pass</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">finally</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   os.chdir(cwd)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'entered {}'</span>.<span style="color: #006FE0;">format</span>(os.getcwd()))
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> inner
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> outer
<span style="color: #8D8D84;">##################################################################</span>

<span style="color: #6434A3;">@cd</span>(<span style="color: #008000;">'/tmp'</span>)
<span style="color: #0000FF;">def</span> <span style="color: #006699;">f</span>():
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">with</span> <span style="color: #006FE0;">open</span>(<span style="color: #008000;">'decorated-file'</span>, <span style="color: #008000;">'w'</span>) <span style="color: #0000FF;">as</span> f:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   f.write(<span style="color: #008000;">"5"</span>)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   1 / 0

f()
<span style="color: #0000FF;">print</span>(<span style="color: #006FE0;">open</span>(<span style="color: #008000;">"/tmp/decorated-file"</span>).read())
</pre>
</div>

<pre class="example">
Started in /Users/jkitchin/Dropbox/python/hyve
entered /private/tmp
entered /Users/jkitchin/Dropbox/python/hyve
5
</pre>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> A hy macro approach</h2>
<div class="outline-text-2" id="text-4">
<p>
hy gives us yet another option: a macro. We can use a macro to construct the context for us by building up the try/except/finally code we used above. The indentation used here is just for readability.
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">cd</span> [wd <span style="color: #6434A3;">&amp;rest</span> body]
  `(<span style="color: #0000FF;">do</span>
    (<span style="color: #0000FF;">import</span> <span style="color: #006699;">os</span>)
    (<span style="color: #006FE0;">print</span> <span style="color: #008000;">"started in "</span> (os.getcwd))
    (<span style="color: #0000FF;">let</span> [cwd (os.getcwd)]
      (<span style="color: #0000FF;">try</span>
       (<span style="color: #0000FF;">do</span> (os.chdir ~wd)
           (<span style="color: #006FE0;">print</span> <span style="color: #008000;">"entered "</span> (os.getcwd))
           ~@body)
       (<span style="color: #0000FF;">except</span> [e Exception] <span style="color: #D0372D;">nil</span>)
       (<span style="color: #0000FF;">finally</span>
        (os.chdir cwd)
        (<span style="color: #006FE0;">print</span> <span style="color: #008000;">"entered "</span> (os.getcwd)))))))


<span style="color: #8D8D84;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
(cd <span style="color: #008000;">"/tmp"</span>
    (<span style="color: #0000FF;">with</span> [f (open <span style="color: #008000;">"some-hy-file"</span> <span style="color: #008000;">"w"</span>)]
          (.write f <span style="color: #008000;">"5"</span>)
          (<span style="color: #006FE0;">/</span> 1 0)))

(<span style="color: #006FE0;">print</span> (.read (open <span style="color: #008000;">"/tmp/some-hy-file"</span>)))
</pre>
</div>

<pre class="example">
started in  /Users/jkitchin/Dropbox/python/hyve
entered  /private/tmp
entered  /Users/jkitchin/Dropbox/python/hyve
5
</pre>


<p>
The results are the same, even down to the reduced number of lines! But the mechanism that achieves that is different. In this example, we subtly changed the syntax that was possible, eliminating the need for one of the "with" statements. This is only possible with this kind of macro construction as far as I know. It still is not a game changer of programming, but does illustrate some new ways to think about writing these programs. It is not necessary to wrap the code into a function just to delay it from being executed.
</p>
</div>
</div>
<p>Copyright (C) 2016 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2016/04/28/Managing-contexts---Python-vs-hy.org">org-mode source</a></p>
<p>Org-mode version = 8.2.10</p>